Você já criou o banco de dados, já criou as tabelas e inseriu os dados.
Praticamos até aqui a arquitetura de um banco de dados, DDl, DML para criar as tabelas e
inserir, deletar e manipular dados dentro do nosso banco.

# instalações:

In [2]:
pip install psycopg2 pandas

Requirement already satisfied: psycopg2 in ./.venv/lib/python3.12/site-packages (2.9.9)
Collecting pandas
  Using cached pandas-2.2.2-cp312-cp312-macosx_11_0_arm64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Using cached numpy-2.0.1-cp312-cp312-macosx_14_0_arm64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.2.2-cp312-cp312-macosx_11_0_arm64.whl (11.3 MB)
Using cached numpy-2.0.1-cp312-cp312-macosx_14_0_arm64.whl (5.0 MB)
Using cached pytz-2024.1-py2.py3-none-any.whl (505 kB)
Using cached tzdata-2024.1-py2.py3-none-any.whl (345 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.0.1 pandas-2.2.2 pytz-2024.1 tzdata-2024.1
Note: you may need to restart the kernel to use updated packages.

In [6]:
import psycopg2
import pandas as pd

#### Se conectar ao banco:

In [7]:
# Conectando ao banco de dados
conn = psycopg2.connect(
    dbname="seu_banco_de_dados",
    user="seu_usuario",
    password="sua_senha",
    host="localhost",  # ou outro host onde seu banco de dados está localizado
    port="5432"
)

cursor = conn.cursor()

#### 1. Selecione todos produtos de uma categoria.

In [13]:
def select_products_by_category(category):
    query = "SELECT * FROM Produtos WHERE Categoria = %s"
    return pd.read_sql(query, conn, params=(category,))

In [14]:
select_products_by_category('Eletrônicos').head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/3111866867.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn, params=(category,))

,id_produto,nome,descricao,preco,estoque,categoria
0,2,key,Me effect detail laugh family perhaps anything...,276.75,90,Eletrônicos
1,5,institution,Already agency trip.,220.61,84,Eletrônicos
2,6,bar,Teacher beautiful authority rule.,609.60,71,Eletrônicos
3,12,identify,Per better nor half.,580.89,16,Eletrônicos
4,18,impact,Daughter join apply lawyer yet address.,558.72,85,Eletrônicos

#### 2. Nome e endereço dos clientes que fizeram um pedido em 2024

In [15]:
def select_clients_orders_2024():
    query = """
    SELECT c.Nome, c.Endereco
    FROM Clientes c
    JOIN Pedidos p ON c.ID_Cliente = p.ID_Cliente
    WHERE EXTRACT(YEAR FROM p.Data_Pedido) = 2024
    """
    return pd.read_sql(query, conn)

In [17]:
select_clients_orders_2024().head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/2167292931.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

               nome                                           endereco
0      David Rhodes  67678 Castillo Ports Suite 690\nWest Richardla...
1      Jake Vasquez                   PSC 3250, Box 0193\nAPO AP 85313
2     James Daniels    691 Richard Flat Apt. 564\nAlicialand, IA 32372
3  Krista Singleton      19052 Kimberly Drive\nNorth Melissa, RI 75545
4       Lisa Murray    5251 Jason Flats Apt. 454\nScottville, TX 41331

#### 3. Produtos com preço entre 50 e 100:

In [18]:
def select_products_price_range():
    query = "SELECT * FROM Produtos WHERE Preco BETWEEN 50 AND 100"
    return pd.read_sql(query, conn)

In [19]:
select_products_price_range().head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/2875031338.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

,id_produto,nome,descricao,preco,estoque,categoria
0,29,outside,Indeed this up.,56.53,35,Livros
1,38,fall,Hotel across others include owner help single.,55.38,43,Móveis
2,43,teach,Ground director hear about stuff suddenly.,98.36,48,Eletrônicos
3,61,operation,Lay write where behavior.,98.85,67,Alimentos
4,83,summer,Party operation window rate body.,64.65,93,Eletrônicos

#### 4. Número total de pedidos feitos em julho de 2024:

In [20]:
def count_orders_july_2024():
    query = """
    SELECT COUNT(*) AS Total_Pedidos
    FROM Pedidos
    WHERE EXTRACT(YEAR FROM Data_Pedido) = 2024
      AND EXTRACT(MONTH FROM Data_Pedido) = 7
    """
    return pd.read_sql(query, conn)

In [22]:
count_orders_july_2024()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/1948062717.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

   total_pedidos
0            856

#### 5. Total pago por cada pedido:

In [23]:
def total_paid_per_order():
    query = "SELECT ID_Pedido, SUM(Valor_Pago) AS Total_Pago FROM Pagamentos GROUP BY ID_Pedido"
    return pd.read_sql(query, conn)

In [25]:
total_paid_per_order().head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/715912921.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

   id_pedido  total_pago
0       1489     1523.24
1       3936     3496.21
2       2574     2831.54
3        951     4080.79
4       5761      883.46

#### 6. Nome dos clientes e valor total dos seus pedidos

In [26]:
def total_value_per_client():
    query = """
    SELECT c.Nome, SUM(p.Valor_Total) AS Total_Pedido
    FROM Clientes c
    JOIN Pedidos p ON c.ID_Cliente = p.ID_Cliente
    GROUP BY c.Nome
    """
    return pd.read_sql(query, conn)

In [28]:
total_value_per_client().head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/3781204404.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

               nome  total_pedido
0   Brandon Jackson       4558.02
1  Victor Henderson         95.68
2     Erica Collins       9102.12
3      Natasha Sosa       6515.12
4      Amy Mitchell      11409.74

#### 7. Produtos com estoque menor que 10:

In [29]:
def products_low_stock():
    query = "SELECT * FROM Produtos WHERE Estoque < 10"
    return pd.read_sql(query, conn)

In [30]:
products_low_stock().head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/2642821584.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

,id_produto,nome,descricao,preco,estoque,categoria
0,7,very,Certainly smile why large.,19.78,2,Roupas
1,9,yeah,Along impact build center moment.,482.39,3,Roupas
2,24,option,People social visit age consumer.,203.51,3,Roupas
3,42,should,Choose finish information air book today.,500.89,6,Roupas
4,44,despite,Its improve avoid power.,766.17,1,Alimentos

#### 8. Pedidos com status e quantidade de itens em cada pedido:

In [31]:
def orders_with_item_count():
    query = """
    SELECT p.ID_Pedido, p.Status, COUNT(i.ID_Item) AS Quantidade_Itens
    FROM Pedidos p
    JOIN Itens_Pedido i ON p.ID_Pedido = i.ID_Pedido
    GROUP BY p.ID_Pedido, p.Status
    """
    return pd.read_sql(query, conn)

In [32]:
orders_with_item_count().head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/716184307.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

   id_pedido     status  quantidade_itens
0       3936   Pendente                 1
1       5761  Concluído                 2
2       5468  Cancelado                 1
3       7662  Cancelado                 1
4       4326  Concluído                 2

#### 9. Produtos que não foram vendidos em nenhum pedido:

In [33]:
def unsold_products():
    query = """
    SELECT * FROM Produtos
    WHERE ID_Produto NOT IN (
        SELECT DISTINCT ID_Produto
        FROM Itens_Pedido
    )
    """
    return pd.read_sql(query, conn)

In [35]:
unsold_products().head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/2977922777.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

,id_produto,nome,descricao,preco,estoque,categoria
0,1,another,Take life win its without today.,627.23,20,Roupas
1,2,key,Me effect detail laugh family perhaps anything...,276.75,90,Eletrônicos
2,3,kind,Two leg here opportunity long.,254.76,99,Livros
3,4,data,Economy charge recognize bad develop detail.,389.65,67,Roupas
4,5,institution,Already agency trip.,220.61,84,Eletrônicos

#### 10. Os 10 maiores clientes por quantidade de pedidos:

In [36]:
def top_10_clients_by_orders():
    query = """
    SELECT c.Nome, COUNT(p.ID_Pedido) AS Quantidade_Pedidos
    FROM Clientes c
    JOIN Pedidos p ON c.ID_Cliente = p.ID_Cliente
    GROUP BY c.Nome
    ORDER BY Quantidade_Pedidos DESC
    LIMIT 10
    """
    return pd.read_sql(query, conn)

In [38]:
top_10_clients_by_orders()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/4220099528.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

               nome  quantidade_pedidos
0     Michael Brown                  10
1       James Smith                   8
2    Timothy Taylor                   7
3    James Williams                   7
4  Matthew Williams                   6
5     William Smith                   6
6      Thomas Smith                   6
7     Michael Smith                   6
8      Lisa Johnson                   5
9      Edward Moore                   5

#### 11. Produto mais caro e mais barato:

In [39]:
def most_and_least_expensive_products():
    query = """
    SELECT 'Mais Caro' AS Tipo, ID_Produto, Nome, Descricao, Preco, Estoque, Categoria
    FROM (
        SELECT * FROM Produtos
        ORDER BY Preco DESC
        LIMIT 1
    ) AS Mais_Caro

    UNION ALL

    SELECT 'Mais Barato' AS Tipo, ID_Produto, Nome, Descricao, Preco, Estoque, Categoria
    FROM (
        SELECT * FROM Produtos
        ORDER BY Preco ASC
        LIMIT 1
    ) AS Mais_Barato
    """
    return pd.read_sql(query, conn)

In [40]:
most_and_least_expensive_products()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/1342617978.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

,tipo,id_produto,nome,descricao,preco,estoque,categoria
0,Mais Caro,15136,those,Determine day art key ten reach question dream.,1000.00,43,Roupas
1,Mais Barato,4203,house,Often stuff talk Mrs ever big.,10.01,44,Alimentos

#### 12. Idade média dos clientes:

In [41]:
def average_client_age():
    query = "SELECT AVG(EXTRACT(YEAR FROM AGE(Data_Nascimento))) AS Idade_Media FROM Clientes"
    return pd.read_sql(query, conn)

In [42]:
average_client_age()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/3129890776.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

   idade_media
0     57.76275

#### 13. Clientes que possuem o mesmo sobrenome:

In [43]:
def clients_with_same_last_name():
    query = """
    SELECT Nome, COUNT(*) AS Quantidade
    FROM Clientes
    GROUP BY Nome
    HAVING COUNT(*) > 1
    """
    return pd.read_sql(query, conn)

In [45]:
clients_with_same_last_name().head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/1891913882.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

               nome  quantidade
0        James Hall           3
1      John Vasquez           2
2       Logan Lopez           2
3        Wendy Hill           2
4  Richard Phillips           2

#### 14. Pedidos feitos por clientes cujo nome começa com 'A':

In [46]:
def orders_by_clients_name_starts_with_A():
    query = """
    SELECT p.*
    FROM Pedidos p
    JOIN Clientes c ON p.ID_Cliente = c.ID_Cliente
    WHERE c.Nome LIKE 'A%'
    """
    return pd.read_sql(query, conn)

In [48]:
orders_by_clients_name_starts_with_A().head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/2510893945.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

   id_pedido data_pedido     status  valor_total  id_cliente
0        647  2024-07-09  Concluído      4740.26       10730
1        650  2024-01-23  Concluído      1051.60       15886
2        657  2024-07-14   Pendente      1638.95         534
3        660  2024-04-23   Pendente      3250.24         914
4        672  2024-07-14  Concluído      4989.39       19934

#### 15. Produtos, sua categoria e indicação de estoque:

In [49]:
def products_with_stock_status():
    query = """
    SELECT Nome, Categoria,
           CASE 
               WHEN Estoque > 0 THEN 'Em Estoque'
               ELSE 'Esgotado'
           END AS Status_Estoque
    FROM Produtos
    """
    return pd.read_sql(query, conn)

In [51]:
products_with_stock_status().head()

/var/folders/1q/xq08b0k14gvdn4l2lhcx_7wm0000gn/T/ipykernel_16435/2325366981.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, conn)

          nome    categoria status_estoque
0      another       Roupas     Em Estoque
1          key  Eletrônicos     Em Estoque
2         kind       Livros     Em Estoque
3         data       Roupas     Em Estoque
4  institution  Eletrônicos     Em Estoque

#### Fechar a conexão:

In [52]:
cursor.close()
conn.close()